{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": {"m": 2, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 57, "subsample": [1, 1], "init": "orthogonal", "nb_filter": 90, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 3, 129, 129], "W_regularizer": {"l2": 9.999999747378752e-05, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [3, 4], "strides": [1, 3], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": {"m": 2, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "nb_filter": 90, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [1, 3], "strides": [1, 3], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": {"m": 2, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "orthogonal", "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 256}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_constraint": {"m": 2, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "orthogonal", "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 256}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 2}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_5"}}]}